In [0]:
# Table: Views

# +---------------+---------+
# | Column Name   | Type    |
# +---------------+---------+
# | article_id    | int     |
# | author_id     | int     |
# | viewer_id     | int     |
# | view_date     | date    |
# +---------------+---------+
# There is no primary key (column with unique values) for this table, the table may have duplicate rows.
# Each row of this table indicates that some viewer viewed an article (written by some author) on some date. 
# Note that equal author_id and viewer_id indicate the same person.
 
# Write a solution to find all the authors that viewed at least one of their own articles.
# Return the result table sorted by id in ascending order.
# The result format is in the following example.

# Example 1:

# Input: 
# Views table:
# +------------+-----------+-----------+------------+
# | article_id | author_id | viewer_id | view_date  |
# +------------+-----------+-----------+------------+
# | 1          | 3         | 5         | 2019-08-01 |
# | 1          | 3         | 6         | 2019-08-02 |
# | 2          | 7         | 7         | 2019-08-01 |
# | 2          | 7         | 6         | 2019-08-02 |
# | 4          | 7         | 1         | 2019-07-22 |
# | 3          | 4         | 4         | 2019-07-21 |
# | 3          | 4         | 4         | 2019-07-21 |
# +------------+-----------+-----------+------------+

# Output: 
# +------+
# | id   |
# +------+
# | 4    |
# | 7    |
# +------+

from pyspark.sql.functions import col 

data = [
(1, 3, 5, '2019-08-01'),
(1, 3, 6, '2019-08-02'),
(2, 7, 7, '2019-08-01'),
(2, 7, 6, '2019-08-02'),
(4, 7, 1, '2019-07-22'),
(3, 4, 4, '2019-07-21'),
(3, 4, 4, '2019-07-21'),
]

columns = ['article_id' , 'author_id' , 'viewer_id' , 'view_date']

df = spark.createDataFrame(data, columns)
display(df)

df1 = df.where("author_id = viewer_id").select(col('author_id').alias('id')).distinct().sort("id", ascending=True)
display(df1)

In [0]:
# Table: Tweets

# +----------------+---------+
# | Column Name    | Type    |
# +----------------+---------+
# | tweet_id       | int     |
# | content        | varchar |
# +----------------+---------+
# tweet_id is the primary key (column with unique values) for this table.
# content consists of alphanumeric characters, '!', or ' ' and no other special characters.
# This table contains all the tweets in a social media app.

# Write a solution to find the IDs of the invalid tweets. The tweet is invalid if the number of characters used in the content of the tweet is strictly greater than 15.

# Return the result table in any order.
# The result format is in the following example.

# Example 1:

# Input: 
# Tweets table:
# +----------+-----------------------------------+
# | tweet_id | content                           |
# +----------+-----------------------------------+
# | 1        | Let us Code                       |
# | 2        | More than fifteen chars are here! |
# +----------+-----------------------------------+

# Output: 
# +----------+
# | tweet_id |
# +----------+
# | 2        |
# +----------+
# Explanation: 
# Tweet 1 has length = 11. It is a valid tweet.
# Tweet 2 has length = 33. It is an invalid tweet.

data = [
(1, 'Let us Code'),
(2, 'More than fifteen chars are here!'),
]

columns = ['tweet_id', 'content']

df = spark.createDataFrame(data, columns)
display(df)
df1 = df.where("len(content)>15").select("tweet_id")
display(df1)

In [0]:
# Table: Employees
# +---------------+---------+
# | Column Name   | Type    |
# +---------------+---------+
# | id            | int     |
# | name          | varchar |
# +---------------+---------+
# id is the primary key (column with unique values) for this table.
# Each row of this table contains the id and the name of an employee in a company.
 
# Table: EmployeeUNI
# +---------------+---------+
# | Column Name   | Type    |
# +---------------+---------+
# | id            | int     |
# | unique_id     | int     |
# +---------------+---------+
# (id, unique_id) is the primary key (combination of columns with unique values) for this table.
# Each row of this table contains the id and the corresponding unique id of an employee in the company.
 
# Write a solution to show the unique ID of each user, If a user does not have a unique ID replace just show null.
# Return the result table in any order.
# The result format is in the following example.

# Example 1:

# Input: 
# Employees table:
# +----+----------+
# | id | name     |
# +----+----------+
# | 1  | Alice    |
# | 7  | Bob      |
# | 11 | Meir     |
# | 90 | Winston  |
# | 3  | Jonathan |
# +----+----------+
# EmployeeUNI table:
# +----+-----------+
# | id | unique_id |
# +----+-----------+
# | 3  | 1         |
# | 11 | 2         |
# | 90 | 3         |
# +----+-----------+
# Output: 
# +-----------+----------+
# | unique_id | name     |
# +-----------+----------+
# | null      | Alice    |
# | null      | Bob      |
# | 2         | Meir     |
# | 3         | Winston  |
# | 1         | Jonathan |
# +-----------+----------+
# Explanation: 
# Alice and Bob do not have a unique ID, We will show null instead.
# The unique ID of Meir is 2.
# The unique ID of Winston is 3.
# The unique ID of Jonathan is 1.

col1 = ['id', 'name']
data1 = [
(1 , 'Alice'),
(7 , 'Bob'),
(11, 'Meir'),
(90, 'Winston'),
(3 , 'Jonathan')
]

col2 = ['id', 'unique_id']
data2 = [
(3 , 1),
(11, 2),
(90, 3)
]

df1 = spark.createDataFrame(data1, col1)
df2 = spark.createDataFrame(data2, col2)

df = df1.join(df2, df1.id == df2.id, 'left').select('unique_id', 'name')
display(df)

## 1068. Product Sales Analysis I

In [0]:
# Table: Sales

# +-------------+-------+
# | Column Name | Type  |
# +-------------+-------+
# | sale_id     | int   |
# | product_id  | int   |
# | year        | int   |
# | quantity    | int   |
# | price       | int   |
# +-------------+-------+
# (sale_id, year) is the primary key (combination of columns with unique values) of this table.
# product_id is a foreign key (reference column) to Product table.
# Each row of this table shows a sale on the product product_id in a certain year.
# Note that the price is per unit.
 

# Table: Product

# +--------------+---------+
# | Column Name  | Type    |
# +--------------+---------+
# | product_id   | int     |
# | product_name | varchar |
# +--------------+---------+
# product_id is the primary key (column with unique values) of this table.
# Each row of this table indicates the product name of each product.
 

# Write a solution to report the product_name, year, and price for each sale_id in the Sales table.

# Return the resulting table in any order.

# The result format is in the following example.

 

# Example 1:

# Input: 
# Sales table:
# +---------+------------+------+----------+-------+
# | sale_id | product_id | year | quantity | price |
# +---------+------------+------+----------+-------+ 
# | 1       | 100        | 2008 | 10       | 5000  |
# | 2       | 100        | 2009 | 12       | 5000  |
# | 7       | 200        | 2011 | 15       | 9000  |
# +---------+------------+------+----------+-------+
# Product table:
# +------------+--------------+
# | product_id | product_name |
# +------------+--------------+
# | 100        | Nokia        |
# | 200        | Apple        |
# | 300        | Samsung      |
# +------------+--------------+
# Output: 
# +--------------+-------+-------+
# | product_name | year  | price |
# +--------------+-------+-------+
# | Nokia        | 2008  | 5000  |
# | Nokia        | 2009  | 5000  |
# | Apple        | 2011  | 9000  |
# +--------------+-------+-------+
# Explanation: 
# From sale_id = 1, we can conclude that Nokia was sold for 5000 in the year 2008.
# From sale_id = 2, we can conclude that Nokia was sold for 5000 in the year 2009.
# From sale_id = 7, we can conclude that Apple was sold for 9000 in the year 2011.


data1 = [
(1, 100, 2008, 10, 5000),
(2, 100, 2009, 12, 5000),
(7, 200, 2011, 15, 9000)
]

data2 = [
(100, 'Nokia'),
(200, 'Apple'),
(300, 'Samsung')    
]

col1 = ['sale_id', 'product_id', 'year', 'quantity', 'price']
col2 = ['product_id', 'product_name']

df1 = spark.createDataFrame(data1, col1)
df2 = spark.createDataFrame(data2, col2)

df = df1.join(df2,df1.product_id == df2.product_id,'inner').select("product_name", "year", "price")
display(df)

## 1581. Customer Who Visited but Did Not Make
## Any Transactions

In [0]:
# Table: Visits

# +-------------+---------+
# | Column Name | Type    |
# +-------------+---------+
# | visit_id    | int     |
# | customer_id | int     |
# +-------------+---------+
# visit_id is the column with unique values for this table.
# This table contains information about the customers who visited the mall.
 
# Table: Transactions

# +----------------+---------+
# | Column Name    | Type    |
# +----------------+---------+
# | transaction_id | int     |
# | visit_id       | int     |
# | amount         | int     |
# +----------------+---------+
# transaction_id is column with unique values for this table.
# This table contains information about the transactions made during the visit_id.
 
# Write a solution to find the IDs of the users who visited without making any transactions and the number of times they made these types of visits.
# Return the result table sorted in any order.
# The result format is in the following example.

 # Example 1:

# Input: 
# Visits
# +----------+-------------+
# | visit_id | customer_id |
# +----------+-------------+
# | 1        | 23          |
# | 2        | 9           |
# | 4        | 30          |
# | 5        | 54          |
# | 6        | 96          |
# | 7        | 54          |
# | 8        | 54          |
# +----------+-------------+
# Transactions
# +----------------+----------+--------+
# | transaction_id | visit_id | amount |
# +----------------+----------+--------+
# | 2              | 5        | 310    |
# | 3              | 5        | 300    |
# | 9              | 5        | 200    |
# | 12             | 1        | 910    |
# | 13             | 2        | 970    |
# +----------------+----------+--------+
# Output: 
# +-------------+----------------+
# | customer_id | count_no_trans |
# +-------------+----------------+
# | 54          | 2              |
# | 30          | 1              |
# | 96          | 1              |
# +-------------+----------------+
# Explanation: 
# Customer with id = 23 visited the mall once and made one transaction during the visit with id = 12.
# Customer with id = 9 visited the mall once and made one transaction during the visit with id = 13.
# Customer with id = 30 visited the mall once and did not make any transactions.
# Customer with id = 54 visited the mall three times. During 2 visits they did not make any transactions, and during one visit they made 3 transactions.
# Customer with id = 96 visited the mall once and did not make any transactions.
# As we can see, users with IDs 30 and 96 visited the mall one time without making any transactions. Also, user 54 visited the mall twice and did not make any transactions.

from pyspark.sql.functions import count

data1 = [
(1, 23),
(2, 9 ),
(4, 30),
(5, 54),
(6, 96),
(7, 54),
(8, 54)
]

data2 = [
(2 , 5, 310),
(3 , 5, 300),
(9 , 5, 200),
(12, 1, 910),
(13, 2, 970)
]

col1 = ['visit_id', 'customer_id']
col2 = ['transaction_id', 'visit_id', 'amount']

df1 = spark.createDataFrame(data1, col1)
df2 = spark.createDataFrame(data2, col2)

df = df1.join(df2, df1.visit_id == df2.visit_id, 'left').filter(df2["visit_id"].isNull()).select(df1.visit_id, df1.customer_id).groupBy("customer_id").agg(count("visit_id").alias("count_no_trans"))

display(df)

## Histogram of Tweets
Twitter SQL Interview Question <br>
Difficulty: Easy<br>
Source: https://datalemur.com/questions/sql-histogram-tweets

In [0]:
# Assume you're given a table Twitter tweet data, write a query to obtain a histogram of tweets posted per user in 2022. Output the tweet count per user as the bucket and the number of Twitter users who fall into that bucket.

# In other words, group the users by the number of tweets they posted in 2022 and count the number of users in each group.

# tweets Table:
# Column Name	Type
# tweet_id	integer
# user_id	integer
# msg	string
# tweet_date	timestamp
# tweets Example Input:
# tweet_id	user_id	msg	tweet_date
# 214252	111	Am considering taking Tesla private at $420. Funding secured.	12/30/2021 00:00:00
# 739252	111	Despite the constant negative press covfefe	01/01/2022 00:00:00
# 846402	111	Following @NickSinghTech on Twitter changed my life!	02/14/2022 00:00:00
# 241425	254	If the salary is so competitive why wonâ€™t you tell me what it is?	03/01/2022 00:00:00
# 231574	148	I no longer have a manager. I can't be managed	03/23/2022 00:00:00
# Example Output:
# tweet_bucket	users_num
# 1	2
# 2	1
# Explanation:
# Based on the example output, there are two users who posted only one tweet in 2022, and one user who posted two tweets in 2022. The query groups the users by the number of tweets they posted and displays the number of users in each group.

# The dataset you are querying against may have different input & output - this is just an example!

# Solution

%sql
with tweet_counts AS (
SELECT user_id, count(tweet_id) as tweet_counts FROM tweets
where Year(tweet_date) = 2022
group by user_id)

Select tweet_counts as tweet_bucket, count(user_id) as users_num
from tweet_counts
group by tweet_counts

##Salaries Differences
Difficulty: Easy<br>
Companies: LinkedIn, Dropbox<br>
Source: https://platform.stratascratch.com/coding/10308-salaries-differences?code_type=5

In [0]:
# Calculates the difference between the highest salaries in the marketing and engineering departments. Output just the absolute difference in salaries.

# Tables
# db_employee
# db_dept
# More about this question
# Hints
# Expected Output
# db_employee
# Preview
# department_id:
# bigint
# first_name:
# varchar
# id:
# bigint
# last_name:
# varchar
# salary:
# bigint
# db_dept
# Preview
# department:
# varchar
# id:
# bigint
# Recommended Easy Interview Questions
# ID 2002
# Submission Types
# ID 2004
# Number of Comments Per User in 30 days before 2020-02-10
# ID 2006
# Users Activity Per Month Day
# Recommended Questions from the Same Companies
# ID 9603
# Find fare differences on the Titanic using a self join
# ID 9921
# Department Salaries
# ID 9920
# Sales Dept Salaries


with department_wise_salary as (
select d.department, max(e.salary) as highest_salary 
from db_employee e
join db_dept d
on e.department_id = d.id
where d.department in ('marketing', 'engineering')
group by d.department
)
Select abs(engineering - marketing) from department_wise_salary
PIVOT 
(MAX(highest_salary) 
for department in ([engineering], [marketing])
) as pv

##User's Third Transaction
Uber SQL Interview Question <br>
Difficulty: Medium<br>
Source: https://datalemur.com/questions/sql-third-transaction

In [0]:
%sql
-- Assume you are given the table below on Uber transactions made by users. Write a query to obtain the third transaction of every user. Output the user id, spend and transaction date.

-- transactions Table:
-- Column Name	Type
-- user_id	integer
-- spend	decimal
-- transaction_date	timestamp
-- transactions Example Input:
-- user_id	spend	transaction_date
-- 111	100.50	01/08/2022 12:00:00
-- 111	55.00	01/10/2022 12:00:00
-- 121	36.00	01/18/2022 12:00:00
-- 145	24.99	01/26/2022 12:00:00
-- 111	89.60	02/05/2022 12:00:00
-- Example Output:
-- user_id	spend	transaction_date
-- 111	89.60	02/05/2022 12:00:00
-- The dataset you are querying against may have different input & output - this is just an example!

-- Solution 
with ranked_transactions AS 
(
SELECT 
user_id, 
spend, 
transaction_date,
row_number() over (partition by user_id order by transaction_date) as rnk
FROM transactions
)

Select 
user_id, 
spend, 
transaction_date
from ranked_transactions
where  rnk = 3;

##Second Highest Salary
FAANG SQL Interview Question<br>
Difficulty: Medium<br>
Source: https://datalemur.com/questions/sql-second-highest-salary

In [0]:
%sql

-- Imagine you're an HR analyst at a tech company tasked with analyzing employee salaries. Your manager is keen on understanding the pay distribution and asks you to determine the second highest salary among all employees.

-- It's possible that multiple employees may share the same second highest salary. In case of duplicate, display the salary only once.

-- employee Schema:
-- column_name	type	description
-- employee_id	integer	The unique ID of the employee.
-- name	string	The name of the employee.
-- salary	integer	The salary of the employee.
-- department_id	integer	The department ID of the employee.
-- manager_id	integer	The manager ID of the employee.
-- employee Example Input:
-- employee_id	name	salary	department_id	manager_id
-- 1	Emma Thompson	3800	1	6
-- 2	Daniel Rodriguez	2230	1	7
-- 3	Olivia Smith	2000	1	8
-- Example Output:
-- second_highest_salary
-- 2230
-- The output represents the second highest salary among all employees. In this case, the second highest salary is $2,230.


-- Solution
WITH ranked_emp_salary AS
(
SELECT
SALARY,
DENSE_RANK() OVER(ORDER BY SALARY DESC) AS salary_rnk
FROM employee
)
SELECT SALARY AS second_highest_salary
from ranked_emp_salary
where salary_rnk = 2

##Active User Retention
Facebook SQL Interview Question<br>
Difficulty: Hard<br>
Source: https://datalemur.com/questions/user-retention

In [0]:
%sql

-- Assume you're given a table containing information on Facebook user actions. Write a query to obtain number of monthly active users (MAUs) in July 2022, including the month in numerical format "1, 2, 3".

-- Hint:

-- An active user is defined as a user who has performed actions such as 'sign-in', 'like', or 'comment' in both the current month and the previous month.
-- user_actions Table:
-- Column Name	Type
-- user_id	integer
-- event_id	integer
-- event_type	string ("sign-in, "like", "comment")
-- event_date	datetime
-- user_actionsExample Input:
-- user_id	event_id	event_type	event_date
-- 445	7765	sign-in	05/31/2022 12:00:00
-- 742	6458	sign-in	06/03/2022 12:00:00
-- 445	3634	like	06/05/2022 12:00:00
-- 742	1374	comment	06/05/2022 12:00:00
-- 648	3124	like	06/18/2022 12:00:00
-- Example Output for June 2022:
-- month	monthly_active_users
-- 6	1
-- Example
-- In June 2022, there was only one monthly active user (MAU) with the user_id 445.

-- Please note that the output provided is for June 2022 as the user_actions table only contains event dates for that month. You should adapt the solution accordingly for July 2022.

-- Solution

with monthly_users as (
SELECT DISTINCT user_id, 
date_part('month',event_date) as event_month
FROM user_actions
where event_date between '2022-06-01' and '2022-07-31'
and event_type in ('sign-in', 'like', 'comment')
),
monthly_active_users as
(
Select
user_id,
event_month as month,
lag(event_month) over(partition by user_id order by event_month) as prev_month
from monthly_users
)
SELECT
month,
count(user_id) as monthly_active_users
from monthly_active_users
where prev_month IS NOT NULL
group by month


-- Alternate Solution
SELECT 
  EXTRACT(MONTH FROM curr_month.event_date) AS mth, 
  COUNT(DISTINCT curr_month.user_id) AS monthly_active_users 
FROM user_actions AS curr_month
WHERE EXISTS (
  SELECT last_month.user_id 
  FROM user_actions AS last_month
  WHERE last_month.user_id = curr_month.user_id
    AND EXTRACT(MONTH FROM last_month.event_date) =
    EXTRACT(MONTH FROM curr_month.event_date - interval '1 month')
)
  AND EXTRACT(MONTH FROM curr_month.event_date) = 7
  AND EXTRACT(YEAR FROM curr_month.event_date) = 2022
GROUP BY EXTRACT(MONTH FROM curr_month.event_date);

##Supercloud Customer
Microsoft SQL Interview Question<br>
Difficulty: Medium<br>
Source: https://datalemur.com/questions/supercloud-customer

In [0]:
# A Microsoft Azure Supercloud customer is defined as a customer who has purchased at least one product from every product category listed in the products table.

# Write a query that identifies the customer IDs of these Supercloud customers.

# customer_contracts Table:
# Column Name	Type
# customer_id	integer
# product_id	integer
# amount	integer
# customer_contracts Example Input:
# customer_id	product_id	amount
# 1	1	1000
# 1	3	2000
# 1	5	1500
# 2	2	3000
# 2	6	2000
# products Table:
# Column Name	Type
# product_id	integer
# product_category	string
# product_name	string
# products Example Input:
# product_id	product_category	product_name
# 1	Analytics	Azure Databricks
# 2	Analytics	Azure Stream Analytics
# 4	Containers	Azure Kubernetes Service
# 5	Containers	Azure Service Fabric
# 6	Compute	Virtual Machines
# 7	Compute	Azure Functions
# Example Output:
# customer_id
# 1
# Explanation:
# Customer 1 bought from Analytics, Containers, and Compute categories of Azure, and thus is a Supercloud customer. Customer 2 isn't a Supercloud customer, since they don't buy any container services from Azure.

# The dataset you are querying against may have different input & output - this is just an example!

# Solution1
with product_categories as 
(
Select customer_id, count(distinct product_category) as prod_cat_cnt,
(Select count(distinct product_category) from products) as tot_prod_cat_cnt
from customer_contracts cc 
join products p
on cc.product_id = p.product_id
group by customer_id
)
Select customer_id from product_categories
where prod_cat_cnt = tot_prod_cat_cnt

# Solution2
WITH supercloud_cust AS (
  SELECT 
    customers.customer_id, 
    COUNT(DISTINCT products.product_category) AS product_count
  FROM customer_contracts AS customers
  INNER JOIN products 
    ON customers.product_id = products.product_id
  GROUP BY customers.customer_id
)

SELECT customer_id
FROM supercloud_cust
WHERE product_count = (
  SELECT COUNT(DISTINCT product_category) FROM products
);

##Highest-Grossing Items
Amazon SQL Interview Question<br>
Difficulty: Medium<br>
Source: https://datalemur.com/questions/sql-highest-grossing

In [0]:
%sql

-- Assume you're given a table containing data on Amazon customers and their spending on products in different category, write a query to identify the top two highest-grossing products within each category in the year 2022. The output should include the category, product, and total spend.

-- product_spend Table:
-- Column Name	Type
-- category	string
-- product	string
-- user_id	integer
-- spend	decimal
-- transaction_date	timestamp
-- product_spend Example Input:
-- category	product	user_id	spend	transaction_date
-- appliance	refrigerator	165	246.00	12/26/2021 12:00:00
-- appliance	refrigerator	123	299.99	03/02/2022 12:00:00
-- appliance	washing machine	123	219.80	03/02/2022 12:00:00
-- electronics	vacuum	178	152.00	04/05/2022 12:00:00
-- electronics	wireless headset	156	249.90	07/08/2022 12:00:00
-- electronics	vacuum	145	189.00	07/15/2022 12:00:00
-- Example Output:
-- category	product	total_spend
-- appliance	refrigerator	299.99
-- appliance	washing machine	219.80
-- electronics	vacuum	341.00
-- electronics	wireless headset	249.90
-- Explanation:
-- Within the "appliance" category, the top two highest-grossing products are "refrigerator" and "washing machine."

-- In the "electronics" category, the top two highest-grossing products are "vacuum" and "wireless headset."

-- The dataset you are querying against may have different input & output - this is just an example!

-- Solution1
with category_spend_agg AS
(
SELECT 
category, 
product,
year(transaction_date) as  year,
sum(spend) as total_spend,
row_number() over (partition by category, year(transaction_date)  order by sum(spend) desc) as rnk
FROM product_spend
group by category, product, year(transaction_date)
)
Select 
category,
product,
total_spend
from category_spend_agg
where rnk<=2 and year = 2022
;

-- Solution2
WITH ranked_spending_cte AS (
  SELECT 
    category, 
    product, 
    SUM(spend) AS total_spend,
    RANK() OVER (
      PARTITION BY category 
      ORDER BY SUM(spend) DESC) AS ranking 
  FROM product_spend
  WHERE EXTRACT(YEAR FROM transaction_date) = 2022
  GROUP BY category, product
)

SELECT 
  category, 
  product, 
  total_spend 
FROM ranked_spending_cte 
WHERE ranking <= 2 
ORDER BY category, ranking;

##Sending vs. Opening Snaps
Snapchat SQL Interview Question<br>
Difficulty: Medium<br>
Source: https://datalemur.com/questions/time-spent-snaps

In [0]:
# Assume you're given tables with information on Snapchat users, including their ages and time spent sending and opening snaps.

# Write a query to obtain a breakdown of the time spent sending vs. opening snaps as a percentage of total time spent on these activities grouped by age group. Round the percentage to 2 decimal places in the output.

# Notes:

# Calculate the following percentages:
# time spent sending / (Time spent sending + Time spent opening)
# Time spent opening / (Time spent sending + Time spent opening)
# To avoid integer division in percentages, multiply by 100.0 and not 100.
# Effective April 15th, 2023, the solution has been updated and optimised.

# activities Table
# Column Name	Type
# activity_id	integer
# user_id	integer
# activity_type	string ('send', 'open', 'chat')
# time_spent	float
# activity_date	datetime
# activities Example Input
# activity_id	user_id	activity_type	time_spent	activity_date
# 7274	123	open	4.50	06/22/2022 12:00:00
# 2425	123	send	3.50	06/22/2022 12:00:00
# 1413	456	send	5.67	06/23/2022 12:00:00
# 1414	789	chat	11.00	06/25/2022 12:00:00
# 2536	456	open	3.00	06/25/2022 12:00:00
# age_breakdown Table
# Column Name	Type
# user_id	integer
# age_bucket	string ('21-25', '26-30', '31-25')
# age_breakdown Example Input
# user_id	age_bucket
# 123	31-35
# 456	26-30
# 789	21-25
# Example Output
# age_bucket	send_perc	open_perc
# 26-30	65.40	34.60
# 31-35	43.75	56.25
# Explanation
# Using the age bucket 26-30 as example, the time spent sending snaps was 5.67 and the time spent opening snaps was 3.

# To calculate the percentage of time spent sending snaps, we divide the time spent sending snaps by the total time spent on sending and opening snaps, which is 5.67 + 3 = 8.67.

# So, the percentage of time spent sending snaps is 5.67 / (5.67 + 3) = 65.4%, and the percentage of time spent opening snaps is 3 / (5.67 + 3) = 34.6%.

# The dataset you are querying against may have different input & output - this is just an example!

# Solution1
with user_group_times AS
(
SELECT distinct age_bucket,
sum(time_spent) over(partition by age_bucket) as total_time,
sum(case when activity_type = 'send' then time_spent else 0 end) over(partition by age_bucket) as send_time,
sum(case when activity_type = 'open' then time_spent else 0 end) over(partition by age_bucket) as open_time
FROM activities a
join age_breakdown ab
on a.user_id = ab.user_id
where activity_type in ('send', 'open')
)

Select age_bucket,
round((send_time/total_time)*100.0,2) as send_prc,
round((open_time/total_time)*100.0,2) as open_prc
from user_group_times
order by age_bucket desc

#Solution2
with user_group_times AS
(
SELECT distinct age_bucket,
sum(time_spent) as total_time,
sum(case when activity_type = 'send' then time_spent else 0 end) as send_time,
sum(case when activity_type = 'open' then time_spent else 0 end) as open_time
FROM activities a
join age_breakdown ab
on a.user_id = ab.user_id
where activity_type in ('send', 'open')
group by age_bucket
)

Select age_bucket,
round((send_time/total_time)*100.0,2) as send_prc,
round((open_time/total_time)*100.0,2) as open_prc
from user_group_times
order by age_bucket desc


#Solution3
  SELECT 
    age.age_bucket, 
    SUM(CASE WHEN activities.activity_type = 'send' 
      THEN activities.time_spent ELSE 0 END) AS send_timespent, 
    SUM(CASE WHEN activities.activity_type = 'open' 
      THEN activities.time_spent ELSE 0 END) AS open_timespent, 
    SUM(activities.time_spent) AS total_timespent 
  FROM activities
  INNER JOIN age_breakdown AS age 
    ON activities.user_id = age.user_id 
  WHERE activities.activity_type IN ('send', 'open') 
  GROUP BY age.age_bucket
) 

SELECT 
  age_bucket, 
  ROUND(100.0 * send_timespent / total_timespent, 2) AS send_perc, 
  ROUND(100.0 * open_timespent / total_timespent, 2) AS open_perc 
FROM snaps_statistics;

##Tweets' Rolling Averages
Twitter SQL Interview Question<br>
Difficulty: Medium<br>
Source: https://datalemur.com/questions/rolling-average-tweets

In [0]:
%sql

-- Given a table of tweet data over a specified time period, calculate the 3-day rolling average of tweets for each user. Output the user ID, tweet date, and rolling averages rounded to 2 decimal places.

-- Notes:

-- A rolling average, also known as a moving average or running mean is a time-series technique that examines trends in data over a specified period of time.
-- In this case, we want to determine how the tweet count for each user changes over a 3-day period.
-- Effective April 7th, 2023, the problem statement, solution and hints for this question have been revised.

-- tweets Table:
-- Column Name	Type
-- user_id	integer
-- tweet_date	timestamp
-- tweet_count	integer
-- tweets Example Input:
-- user_id	tweet_date	tweet_count
-- 111	06/01/2022 00:00:00	2
-- 111	06/02/2022 00:00:00	1
-- 111	06/03/2022 00:00:00	3
-- 111	06/04/2022 00:00:00	4
-- 111	06/05/2022 00:00:00	5
-- Example Output:
-- user_id	tweet_date	rolling_avg_3d
-- 111	06/01/2022 00:00:00	2.00
-- 111	06/02/2022 00:00:00	1.50
-- 111	06/03/2022 00:00:00	2.00
-- 111	06/04/2022 00:00:00	2.67
-- 111	06/05/2022 00:00:00	4.00
-- The dataset you are querying against may have different input & output - this is just an example!

-- Solution
SELECT user_id,
tweet_date,
Round(avg(tweet_count) over(partition by user_id order by tweet_date rows between 2 preceding and current row), 2) as rolling_avg_3d
FROM tweets;

##Top Three Salaries
FAANG SQL Interview Question<br>
Difficulty: Medium<br>
Source: https://datalemur.com/questions/sql-top-three-salaries

In [0]:
%sql
-- As part of an ongoing analysis of salary distribution within the company, your manager has requested a report identifying high earners in each department. A 'high earner' within a department is defined as an employee with a salary ranking among the top three salaries within that department.

-- You're tasked with identifying these high earners across all departments. Write a query to display the employee's name along with their department name and salary. In case of duplicates, sort the results of department name in ascending order, then by salary in descending order. If multiple employees have the same salary, then order them alphabetically.

-- Note: Ensure to utilize the appropriate ranking window function to handle duplicate salaries effectively.

-- As of June 18th, we have removed the requirement for unique salaries and revised the sorting order for the results.

-- employee Schema:
-- column_name	type	description
-- employee_id	integer	The unique ID of the employee.
-- name	string	The name of the employee.
-- salary	integer	The salary of the employee.
-- department_id	integer	The department ID of the employee.
-- manager_id	integer	The manager ID of the employee.
-- employee Example Input:
-- employee_id	name	salary	department_id	manager_id
-- 1	Emma Thompson	3800	1	6
-- 2	Daniel Rodriguez	2230	1	7
-- 3	Olivia Smith	2000	1	8
-- 4	Noah Johnson	6800	2	9
-- 5	Sophia Martinez	1750	1	11
-- 6	Liam Brown	13000	3	
-- 7	Ava Garcia	12500	3	
-- 8	William Davis	6800	2	
-- 9	Isabella Wilson	11000	3	
-- 10	James Anderson	4000	1	11
-- department Schema:
-- column_name	type	description
-- department_id	integer	The department ID of the employee.
-- department_name	string	The name of the department.
-- department Example Input:
-- department_id	department_name
-- 1	Data Analytics
-- 2	Data Science
-- Example Output:
-- department_name	name	salary
-- Data Analytics	James Anderson	4000
-- Data Analytics	Emma Thompson	3800
-- Data Analytics	Daniel Rodriguez	2230
-- Data Science	Noah Johnson	6800
-- Data Science	William Davis	6800
-- The output displays the high earners in each department.

-- In the Data Analytics deaprtment, James Anderson leads with a salary of $4,000, followed by Emma Thompson earning $3,800, and Daniel Rodriguez with $2,230.
-- In the Data Science department, both Noah Johnson and William Davis earn $6,800, with Noah listed before William due to alphabetical ordering.

-- Solution
with dept_wise_salary as
(
SELECT e.name, 
d.department_name, 
e.salary,  
dense_rank() over (partition by d.department_name order by salary desc) as rnk
FROM employee e
join department d
on e.department_id = d.department_id
)
Select name, department_name, salary
from dept_wise_salary
where rnk<=3
order by department_name, salary desc, name;

In [0]:
from pyspark.sql import functions as f
from pyspark.sql.window import Window

employee_records = [
(1,'Emma Thompson',3800,1,6),
(2,'Daniel Rodriguez',2230,1,7),
(3,'Olivia Smith',2000,1,8),
(4,'Noah Johnson',6800,2,9),
(5,'Sophia Martinez',1750,1,11),
(6,'Liam Brown',13000,3,None),
(7,'Ava Garcia',12500,3,None),
(8,'William Davis',6800,2,None),
(9,'Isabella Wilson',11000,3,None),
(10,'James Anderson',4000,1,11)
]
department_records = [(1, 'Data Analytics'),
(2, 'Data Science')]

employee_df = spark.createDataFrame(employee_records,['id','name','salary','department_id','manager_id'])
department_df = spark.createDataFrame(department_records,['id','department'])
display(employee_df)
display(department_df)

spec_window = Window.partitionBy("department").orderBy(f.col("salary").desc())
highest_earner_df = employee_df.join(department_df, employee_df.department_id == department_df.id, 'inner')\
                                .select("name", "department", "salary")\
                                    .withColumn("rnk", f.dense_rank().over(spec_window))\
                                        .where("rnk<=3")\
                                            .select("name","department","salary")\
                                                .sort(f.col("department"),f.col("salary").desc(),f.col("name"))
display(highest_earner_df)

##Signup Activation Rate
TikTok SQL Interview Question<br>
Difficulty: Medium<br>
Source: https://datalemur.com/questions/signup-confirmation-rate

In [0]:
%sql

-- New TikTok users sign up with their emails. They confirmed their signup by replying to the text confirmation to activate their accounts. Users may receive multiple text messages for account confirmation until they have confirmed their new account.

-- A senior analyst is interested to know the activation rate of specified users in the emails table. Write a query to find the activation rate. Round the percentage to 2 decimal places.

-- Definitions:

-- emails table contain the information of user signup details.
-- texts table contains the users' activation information.
-- Assumptions:

-- The analyst is interested in the activation rate of specific users in the emails table, which may not include all users that could potentially be found in the texts table.
-- For example, user 123 in the emails table may not be in the texts table and vice versa.
-- Effective April 4th 2023, we added an assumption to the question to provide additional clarity.

-- emails Table:
-- Column Name	Type
-- email_id	integer
-- user_id	integer
-- signup_date	datetime
-- emails Example Input:
-- email_id	user_id	signup_date
-- 125	7771	06/14/2022 00:00:00
-- 236	6950	07/01/2022 00:00:00
-- 433	1052	07/09/2022 00:00:00
-- texts Table:
-- Column Name	Type
-- text_id	integer
-- email_id	integer
-- signup_action	varchar
-- texts Example Input:
-- text_id	email_id	signup_action
-- 6878	125	Confirmed
-- 6920	236	Not Confirmed
-- 6994	236	Confirmed
-- 'Confirmed' in signup_action means the user has activated their account and successfully completed the signup process.

-- Example Output:
-- confirm_rate
-- 0.67
-- Explanation:
-- 67% of users have successfully completed their signup and activated their accounts. The remaining 33% have not yet replied to the text to confirm their signup.

-- Solution
with ranked_texts as
(
Select *, 
row_number() over(partition by email_id order by text_id desc) as rnk
from texts
),
user_actions as
(
SELECT e.email_id, 
t.signup_action
FROM emails e
left join ranked_texts t
on e.email_id = t.email_id
where t.rnk = 1 or t.rnk is null
)

Select Round(Sum(Case when signup_action = 'Confirmed' then 1.0 else 0.0 End)/count(email_id), 2) as confirm_rate
from user_actions

##Spotify Streaming History
Spotify SQL Interview Question<br>
Difficulty: Medium<br>
Source: https://datalemur.com/questions/spotify-streaming-history

In [0]:
%sql

-- You're given two tables containing data on Spotify users' streaming activity: songs_history which has historical streaming data, and songs_weekly which has data from the current week.

-- Write a query that outputs the user ID, song ID, and cumulative count of song plays up to August 4th, 2022, sorted in descending order.

-- Assume that there may be new users or songs in the songs_weekly table that are not present in the songs_history table.

-- Definitions:

-- song_weeklytable only contains data for the week of August 1st to August 7th, 2022.
-- songs_history table contains data up to July 31st, 2022. The query should include historical data from this table.
-- songs_history Table:
-- Column Name	Type
-- history_id	integer
-- user_id	integer
-- song_id	integer
-- song_plays	integer
-- songs_history Example Input:
-- history_id	user_id	song_id	song_plays
-- 10011	777	1238	11
-- 12452	695	4520	1
-- song_plays field contains the historical data of the number of times a user has played a particular song.

-- songs_weekly Table:
-- Column Name	Type
-- user_id	integer
-- song_id	integer
-- listen_time	datetime
-- songs_weekly Example Input:
-- user_id	song_id	listen_time
-- 777	1238	08/01/2022 12:00:00
-- 695	4520	08/04/2022 08:00:00
-- 125	9630	08/04/2022 16:00:00
-- 695	9852	08/07/2022 12:00:00
-- Example Output:
-- user_id	song_id	song_plays
-- 777	1238	12
-- 695	4520	2
-- 125	9630	1
-- On 4 August 2022, the data shows that User 777 listened to the song with song ID 1238 for a total of 12 times, with 11 of those times occurring before the current week and 1 time occurring within the current week.

-- However, the streaming data for User 695 with the song ID 9852 are not included in the output because the streaming date for that record falls outside the date range specified in the question.

-- Solution

with songs_weekly_agg AS
(
Select user_id, song_id, count(*) as weekly_song_plays
from songs_weekly
where listen_time < '2022-08-05'
group by user_id, song_id
)
SELECT  
coalesce(sh.user_id,sw.user_id) as user_id, 
coalesce(sh.song_id,sw.song_id) as song_id, 
(coalesce(sh.song_plays,0) + coalesce(sw.weekly_song_plays,0)) as song_plays 
FROM songs_history sh
full join songs_weekly_agg sw
on sh.user_id = sw.user_id
and sh.song_id = sw.song_id
order by (coalesce(sh.song_plays,0) + coalesce(sw.weekly_song_plays,0)) desc;

##Odd and Even Measurements
Google SQL Interview Question<br>
Difficulty: Medium<br>
Source: https://datalemur.com/questions/odd-even-measurements

In [0]:
%sql

-- Assume you're given a table with measurement values obtained from a Google sensor over multiple days with measurements taken multiple times within each day.

-- Write a query to calculate the sum of odd-numbered and even-numbered measurements separately for a particular day and display the results in two different columns. Refer to the Example Output below for the desired format.

-- Definition:

-- Within a day, measurements taken at 1st, 3rd, and 5th times are considered odd-numbered measurements, and measurements taken at 2nd, 4th, and 6th times are considered even-numbered measurements.
-- Effective April 15th, 2023, the question and solution for this question have been revised.

-- measurements Table:
-- Column Name	Type
-- measurement_id	integer
-- measurement_value	decimal
-- measurement_time	datetime
-- measurements Example Input:
-- measurement_id	measurement_value	measurement_time
-- 131233	1109.51	07/10/2022 09:00:00
-- 135211	1662.74	07/10/2022 11:00:00
-- 523542	1246.24	07/10/2022 13:15:00
-- 143562	1124.50	07/11/2022 15:00:00
-- 346462	1234.14	07/11/2022 16:45:00
-- Example Output:
-- measurement_day	odd_sum	even_sum
-- 07/10/2022 00:00:00	2355.75	1662.74
-- 07/11/2022 00:00:00	1124.50	1234.14
-- Explanation
-- Based on the results,

-- On 07/10/2022, the sum of the odd-numbered measurements is 2355.75, while the sum of the even-numbered measurements is 1662.74.
-- On 07/11/2022, there are only two measurements available. The sum of the odd-numbered measurements is 1124.50, and the sum of the even-numbered measurements is 1234.14.
-- The dataset you are querying against may have different input & output - this is just an example!

-- Solution
with daywise_ranked_measurments as
(
SELECT date_trunc('day', measurement_time) as measurement_day, 
row_number() over (partition by date_trunc('day', measurement_time) order by measurement_time) as rnk
FROM measurements
)
Select measurement_day,
sum(case when rnk%2<>0 then measurement_value else 0 end) as odd_sum,
sum(case when rnk%2==0 then measurement_value else 0 end) as even_sum
from daywise_ranked_measurments
group by measurement_day
order by measurement_day

In [0]:
from pyspark.sql.functions import *
from pyspark.sql.window import Window

measurement_records = [
(131233,1109.51,'07/10/2022 09:00:00'),
(135211,1662.74,'07/10/2022 11:00:00'),
(523542,1246.24,'07/10/2022 13:15:00'),
(143562,1124.50,'07/11/2022 15:00:00'),
(346462,1234.14,'07/11/2022 16:45:00')
]

measurement_cols = ['measurement_id', 'measurement_value', 'measurement_time']

measurement_df = spark.createDataFrame(measurement_records, measurement_cols)
# display(measurement_df)
measurement_df = measurement_df.withColumn("measurement_time", to_timestamp("measurement_time", "MM/dd/yyyy HH:mm:ss"))
display(measurement_df)
measurement_df.createOrReplaceTempView("measurements")

result_df = spark.sql("""with daywise_ranked_measurments as
(
SELECT date_trunc('day', measurement_time) as measurement_day, 
measurement_value,
row_number() over (partition by date_trunc('day', measurement_time) order by measurement_time) as rnk
FROM measurements
)
Select measurement_day,
sum(case when rnk%2<>0 then measurement_value else 0 end) as odd_sum,
sum(case when rnk%2==0 then measurement_value else 0 end) as even_sum
from daywise_ranked_measurments
group by measurement_day
order by measurement_day
""")
display(result_df)


spec_window = Window.partitionBy("measurement_day").orderBy("measurement_time")
result_df_2 = measurement_df.withColumn("measurement_day", date_trunc('day', "measurement_time"))\
                            .withColumn("rnk", row_number().over(spec_window))\
                                .select("measurement_day","measurement_value", "rnk")\
                                    .groupBy("measurement_day")\
                                    .agg(sum(expr("case when rnk%2!=0 then measurement_value else 0 end")).alias("odd_sum"),
                                         sum(expr("case when rnk%2==0 then measurement_value else 0 end")).alias("even_sum"))\
                                             .select("measurement_day", "odd_sum", "even_sum")
display(result_df_2)

In [0]:
%sql

-- Zomato is a leading online food delivery service that connects users with various restaurants and cuisines, allowing them to browse menus, place orders, and get meals delivered to their doorsteps.

-- Recently, Zomato encountered an issue with their delivery system. Due to an error in the delivery driver instructions, each item's order was swapped with the item in the subsequent row. As a data analyst, you're asked to correct this swapping error and return the proper pairing of order ID and item.

-- If the last item has an odd order ID, it should remain as the last item in the corrected data. For example, if the last item is Order ID 7 Tandoori Chicken, then it should remain as Order ID 7 in the corrected data.

-- In the results, return the correct pairs of order IDs and items.

-- orders Schema:
-- column_name	type	description
-- order_id	integer	The ID of each Zomato order.
-- item	string	The name of the food item in each order.
-- orders Example Input:
-- Here's a sample of the initial incorrect data:

-- order_id	item
-- 1	Chow Mein
-- 2	Pizza
-- 3	Pad Thai
-- 4	Butter Chicken
-- 5	Eggrolls
-- 6	Burger
-- 7	Tandoori Chicken
-- orders Example Output:
-- The corrected data should look like this:

-- corrected_order_id	item
-- 1	Pizza
-- 2	Chow Mein
-- 3	Butter Chicken
-- 4	Pad Thai
-- 5	Burger
-- 6	Eggrolls
-- 7	Tandoori Chicken
-- Order ID 1 is now associated with Pizza and Order ID 2 is paired with Chow Mein. This adjustment ensures that each order is correctly aligned with its respective item, addressing the initial swapping error.

-- Order ID 7 remains unchanged and is still associated with Tandoori Chicken. This preserves the order sequence ensuring that the last odd order ID remains unaltered.

-- Solution

with orders_modified as
(
SELECT order_id as corrected_order_id,
item,
lag(item) over(order by order_id) as lag_item,
lead(item) over(order by order_id) as lead_item,
max(order_id) over() as max_order_id
FROM orders
)
Select corrected_order_id,
Case 
When corrected_order_id%2<>0 and corrected_order_id<>max_order_id then lead_item
When corrected_order_id%2=0 then lag_item
Else item 
End as item
from orders_modified;

In [0]:
from pyspark.sql. functions import *
from pyspark.sql.window import Window

orders_records = [
(1, 'Chow Mein'),
(2, 'Pizza'),
(3, 'Pad Thai'),
(4, 'Butter Chicken'),
(5, 'Eggrolls'),
(6, 'Burger'),
(7, 'Tandoori Chicken')
]

cols = ['order_id', 'item']
orders_df = spark.createDataFrame(orders_records, cols)
display(orders_df)

spec_window = Window.orderBy("order_id")
spec_window2 = Window.rowsBetween(Window.unboundedPreceding, Window.unboundedFollowing)
result_df1 = orders_df.withColumn("lag_item", lag("item").over(spec_window))\
                        .withColumn("lead_item", lead("item").over(spec_window))\
                            .withColumn("max_order_id", max("order_id").over(spec_window2))
display(result_df1)
result_df2 = result_df1.withColumn("item", when((col("order_id")%2!=0) & 
                                                    (col("max_order_id")!=col("order_id")), 
                                                    col("lead_item"))
                                            .when(col("order_id")%2==0, col("lag_item"))
                                            .otherwise(col("item")))\
                                    .select(expr("order_id as Corrected_Order_Id"), "item")
display(result_df2)

##FAANG Stock Min-Max (Part 1)
Bloomberg SQL Interview Question<br>
Difficulty: Medium<br>
Source: https://datalemur.com/questions/sql-bloomberg-stock-min-max-1

In [0]:
%sql

-- The Bloomberg terminal is the go-to resource for financial professionals, offering convenient access to a wide array of financial datasets. As a Data Analyst at Bloomberg, you have access to historical data on stock performance.

-- Currently, you're analyzing the highest and lowest open prices for each FAANG stock by month over the years.

-- For each FAANG stock, display the ticker symbol, the month and year ('Mon-YYYY') with the corresponding highest and lowest open prices (refer to the Example Output format). Ensure that the results are sorted by ticker symbol.

-- stock_prices Schema:
-- Column Name	Type	Description
-- date	datetime	The specified date (mm/dd/yyyy) of the stock data.
-- ticker	varchar	The stock ticker symbol (e.g., AAPL) for the corresponding company.
-- open	decimal	The opening price of the stock at the start of the trading day.
-- high	decimal	The highest price reached by the stock during the trading day.
-- low	decimal	The lowest price reached by the stock during the trading day.
-- close	decimal	The closing price of the stock at the end of the trading day.
-- stock_prices Example Input:
-- Note that the table below displays randomly selected AAPL data.

-- date	ticker	open	high	low	close
-- 01/31/2023 00:00:00	AAPL	142.28	142.70	144.34	144.29
-- 02/28/2023 00:00:00	AAPL	146.83	147.05	149.08	147.41
-- 03/31/2023 00:00:00	AAPL	161.91	162.44	165.00	164.90
-- 04/30/2023 00:00:00	AAPL	167.88	168.49	169.85	169.68
-- 05/31/2023 00:00:00	AAPL	176.76	177.33	179.35	177.25
-- Example Output:
-- ticker	highest_mth	highest_open	lowest_mth	lowest_open
-- AAPL	May-2023	176.76	Jan-2023	142.28
-- Apple Inc. (AAPL) achieved its highest opening price of $176.76 in May 2023 and its lowest opening price of $142.28 in January 2023.

-- Solution
with stock_prices_partitioned
as (
SELECT *,
max(open) over(partition by ticker) as max_open,
min(open) over(partition by ticker) as min_open
FROM stock_prices
),
max_stock_prices
as (
Select ticker, 
concat(to_char(date, 'Mon'), '-', cast(date_part('year',date) as varchar)) as highest_mth,
open as highest_open
from stock_prices_partitioned
where open = max_open 
),
min_stock_prices
as (
Select ticker, 
concat(to_char(date, 'Mon'), '-', cast(date_part('year',date) as varchar)) as lowest_mth,
open as lowest_open
from stock_prices_partitioned
where open = min_open 
)
Select h.ticker,
h.highest_mth,
h.highest_open,
l.lowest_mth,
l.lowest_open
from max_stock_prices h
join min_stock_prices l
on h.ticker = l.ticker
order by ticker
;

##User Shopping Sprees
Amazon SQL Interview Question<br>
Difficulty: Medium<br>
Source: https://datalemur.com/questions/amazon-shopping-spree

In [0]:
%sql

-- In an effort to identify high-value customers, Amazon asked for your help to obtain data about users who go on shopping sprees. A shopping spree occurs when a user makes purchases on 3 or more consecutive days.

-- List the user IDs who have gone on at least 1 shopping spree in ascending order.

-- transactions Table:
-- Column Name	Type
-- user_id	integer
-- amount	float
-- transaction_date	timestamp
-- transactions Example Input:
-- user_id	amount	transaction_date
-- 1	9.99	08/01/2022 10:00:00
-- 1	55	08/17/2022 10:00:00
-- 2	149.5	08/05/2022 10:00:00
-- 2	4.89	08/06/2022 10:00:00
-- 2	34	08/07/2022 10:00:00
-- Example Output:
-- user_id
-- 2
-- Explanation
-- In this example, user_id 2 is the only one who has gone on a shopping spree.

-- Solution
with transactions_diff as
(SELECT user_id, 
transaction_date,
lead(transaction_date) over(partition by user_id order by transaction_date) as next_transaction_date,
--datediff('day', lead(transaction_date) over(partition by user_id order by transaction_date), transaction_date) as days_diff
(lead(transaction_date) over(partition by user_id order by transaction_date)::date - transaction_date::date) as days_diff
FROM transactions
),
consecutive_transactions as
(Select user_id,
(lead(days_diff) over(partition by user_id order by transaction_date) - days_diff) as diff
from transactions_diff
)
Select distinct user_id 
from consecutive_transactions
where diff = 0;

##Histogram of Users and Purchases
Walmart SQL Interview Question<br>
Difficulty: Medium<br>
Source: https://datalemur.com/questions/histogram-users-purchases

In [0]:
%sql

-- Assume you're given a table on Walmart user transactions. Based on their most recent transaction date, write a query that retrieve the users along with the number of products they bought.

-- Output the user's most recent transaction date, user ID, and the number of products, sorted in chronological order by the transaction date.

-- user_transactions Table:
-- Column Name	Type
-- product_id	integer
-- user_id	integer
-- spend	decimal
-- transaction_date	timestamp
-- user_transactions Example Input:
-- product_id	user_id	spend	transaction_date
-- 3673	123	68.90	07/08/2022 12:00:00
-- 9623	123	274.10	07/08/2022 12:00:00
-- 1467	115	19.90	07/08/2022 12:00:00
-- 2513	159	25.00	07/08/2022 12:00:00
-- 1452	159	74.50	07/10/2022 12:00:00
-- Example Output:
-- transaction_date	user_id	purchase_count
-- 07/08/2022 12:00:00	115	1
-- 07/08/2022 12:00:000	123	2
-- 07/10/2022 12:00:00	159	1

-- Solution
with raked_user_transactions as
(SELECT user_id, 
product_id, 
transaction_date, 
dense_rank() over(partition by user_id order by transaction_date desc) as rnk
FROM user_transactions
)
Select transaction_date, 
user_id,  
count(product_id) as purchase_count
from raked_user_transactions
where rnk = 1
group by transaction_date, user_id
order by transaction_date;